src/cf/Documents/EmploymentContract.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>EmploymentContract</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.EmployeeLimitPlaning</xr:Item>
				<xr:Item>InformationRegister._DemoCompaniesEmployees</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Employee</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._DemoIndividuals</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Department</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._DemoDepartments</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EndContractDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Entity</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._DemoCompanies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Period</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EmployeeCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>LimitsForEmployees</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>TypeOfLimit</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.TypesOfLimitsForEmployees</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>LimitDate</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>LimitDateEnd</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Stage</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.StageOfLimitsForEmployees</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>StageDescription</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Limit</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Amount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Count</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>NotApplicable</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/EmploymentContract/Ext/ManagerModule.bsl
////////////////////////////////////////////////////////////////////////////////
// PUBLIC

#Region Public

Procedure DataInitializationDocument(DocumentRef, AdditionalProperties) Export

	Query = New Query;
	Query.TempTablesManager = AdditionalProperties.ForPosting.StructureTemporaryTables.TempTablesManager;

	Query.SetParameter("Ref", DocumentRef);

	Query.Text = DataInitializationDocumentQueryText();
	Query.Execute(); 

	GenerateTableEmployees(AdditionalProperties);    

	//LimitsForEmployees
	LimitsForEmployeesServer.DataInitializationDocument(DocumentRef, AdditionalProperties);

EndProcedure // DataInitializationDocument()

#EndRegion // Public

////////////////////////////////////////////////////////////////////////////////
// PRIVATE    

#Region Private 

#Region PostingProcedures

Function DataInitializationDocumentQueryText()

	QueryText =
	"SELECT
	|	1 AS LineNumber,
	|	EmploymentContract.Entity AS Entity,
	|	EmploymentContract.Employee AS Employee,
	|	EmploymentContract.Department AS Department,
	|	EmploymentContract.Period AS Period,
	|	EmploymentContract.EmployeeCode AS EmployeeCode,
	|	EmploymentContract.Ref AS Ref
	|INTO TableEmployees
	|FROM
	|	Document.EmploymentContract AS EmploymentContract
	|WHERE
	|	EmploymentContract.Ref = &Ref";

	Return QueryText; 

EndFunction

Procedure GenerateTableEmployees(AdditionalProperties)

	Query = New Query;
	Query.TempTablesManager = AdditionalProperties.ForPosting.StructureTemporaryTables.TempTablesManager;

	Query.Text =
	"SELECT
	|	TableEmployees.Ref 			AS EmploymentContract,
	|	TableEmployees.Entity 		AS Organization,
	|	TableEmployees.Employee 	AS Individual,
	|	TableEmployees.Department 	AS Department_Company,
	|	1							AS OccupiedRates,
	|	TableEmployees.EmployeeCode AS EmployeeCode,
	|	TableEmployees.Period 		AS Period
	|FROM
	|	TableEmployees AS TableEmployees";

	QueryResult = Query.Execute();

	AdditionalProperties.TableForRegisterRecords.Insert("Table_DemoCompaniesEmployees", QueryResult.Unload());

EndProcedure

#EndRegion // PostingProcedures

#EndRegion // Private
